spec/sem4r/ad_group/fixtures/mutate_add-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v201101/AdGroupService' -->
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="https://adwords.google.com/api/adwords/cm/v201101" xmlns:s="https://adwords.google.com/api/adwords/cm/v201101">
   <env:Header>
      <s:RequestHeader env:mustUnderstand="0">
         <authToken>***censured***</authToken>
         <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
         <developerToken>***censured***</developerToken>
         <clientEmail>***censured***</clientEmail>
      </s:RequestHeader>
   </env:Header>
   <env:Body>
      <mutate>
         <operations xsi:type="AdGroupOperation">
            <operator>ADD</operator>
            <operand>
               <campaignId>198190</campaignId>
               <name>sem4r adgroup 0603-084715</name>
               <status>ENABLED</status>
               <bids xsi:type="ManualCPCAdGroupBids">
                  <AdGroupBids.Type>ManualCPCAdGroupBids</AdGroupBids.Type>
                  <keywordMaxCpc>
                     <amount>
                        <ComparableValue.Type>Money</ComparableValue.Type>
                        <microAmount>20000000</microAmount>
                     </amount>
                  </keywordMaxCpc>
                  <siteMaxCpc>
                     <amount>
                        <ComparableValue.Type>Money</ComparableValue.Type>
                        <microAmount>30000000</microAmount>
                     </amount>
                  </siteMaxCpc>
               </bids>
            </operand>
         </operations>
      </mutate>
   </env:Body>
</env:Envelope>
